#+title: Notes
This post is my notes for preparing a coding interview, 
including some thoughts about classic problems, 
and some terminologies that might be necessary for an interview.
** lower_bound, upper_bound, equal_range
the list should be in ascending order

support customized compare which is similar to operator<
#+BEGIN_SRC C++ :flags -std=c++11 :main no
  #include <algorithm>
  #include <iostream>
  #include <vector>
  using namespace std;

  int main() {
    vector<int> arr({0, 1, 2, 3, 4, 5, 5, 6, 7, 10});
    // start, end, value
    auto lower = lower_bound(arr.begin(), arr.end(), 4);
    auto higher = upper_bound(arr.begin(), arr.end(), 4);
    auto equal = equal_range(arr.begin(), arr.end(), 5);

    cout << "lower\t" << *lower << endl;
    cout << "higher\t" << *higher << endl;
    cout << "equal size\t" << equal.second - equal.first << endl;

    return 0;
  }
#+END_SRC

#+RESULTS:
| lower      | 4 |
| higher     | 5 |
| equal size | 2 |
** hash
return size_t
#+BEGIN_SRC C++ :main no :flags -std=c++11
  #include <iostream>
  #include <functional>
  using namespace std;

  int main() {
    auto key = std::hash<std::string>()("hello world");
    cout << "hash: " << key << endl;
    return 0;
  }
#+END_SRC

#+RESULTS:
: hash: 12386028635079221413

*** some STL support
- ~make_heap~ to build a **max* heap using ~operator<~
- ~push_heap~ to add a new element
- ~pop_heap~ to remove the first element, will sort the next element automatically

  #+BEGIN_SRC C++
    // default max heap
    vector<int> heap;
    make_heap(heap.begin(), heap.end());
    int v0 = heap.back();
    // move value to the back
    pop_heap(heap.begin(), heap.end());
    heap.pop_back();

    // put new value to the back
    // push heap will rebuild the heap with the new value
    heap.push_back(7);
    push_heap(heap.begin(), heap.end());
  #+END_SRC

#+BEGIN_SRC C++ :flags -std=c++11 :includes <algorithm> <iostream> <vector> :namespaces std
  using namespace std;

  vector<int> arr({4, 3, 5, 8, 1, 3, 2});
  make_heap(arr.begin(), arr.end());

  cout << "after build" << endl;
  for (auto i : arr) {
    cout << i << " ";
  }
  cout << endl;

  int nnums = arr.size();
  for (int i = 0; i < nnums; i++) {
    pop_heap(arr.begin(), arr.end());
    cout << "the 1-th is " << arr.back() << endl;
    arr.pop_back();
  }
#+END_SRC

#+RESULTS:
| after | build |    |   |   |   |   |
| 8     | 4     | 5  | 3 | 1 | 3 | 2 |
| the   | 1-th  | is | 8 |   |   |   |
| the   | 1-th  | is | 5 |   |   |   |
| the   | 1-th  | is | 4 |   |   |   |
| the   | 1-th  | is | 3 |   |   |   |
| the   | 1-th  | is | 3 |   |   |   |
| the   | 1-th  | is | 2 |   |   |   |
| the   | 1-th  | is | 1 |   |   |   |
*** operators
| ~test~      | access the specific bit                             |
| ~all~       | check if all bits are set to ~true~                 |
| ~any~       |                                                     |
| ~none~      |                                                     |
| ~count~     | returns the number of bits set to ~true~            |
| ~size~      | return the size number of bits that bitset can hold |
| ~set~       | sets bits to ~true~ or gien value                   |
| ~reset~     | sets bits to ~false~                                |
| ~flip~      | toggles the values of bits                          |
| ~to_string~ | returns a string representation of the data         |
| ~to_ulong~  |                                                     |
| ~to_ullong~ |                                                     |
| ~&~         |                                                     |
| \vert       |                                                     |
| ~^~         |                                                     |
| ~<<~        |                                                     |
| ~>>~        |                                                     |

#+BEGIN_SRC C++ :includes <iostream> <bitset> :flags -std=c++11 :namespaces std
  using namespace std;

  bitset<16> bits;
  bits.set(1);
  bits.set(3);
  bits.set(5);

  cout << bits.to_string() << endl;
  cout << "~ " << bits.flip().to_string() << endl;
#+END_SRC

#+RESULTS:
| 101010 |                  |
|      ~ | 1111111111010101 |
*** loggest increasing subsequences
#+BEGIN_SRC C++ :flags -std=c++11 :main no
  #include <iostream>
  #include <vector>
  using namespace std;

  int longestSubseq(const vector<int>& A) {
    // store the maximum
    int res = A.empty() ? 0 : 1;
    vector<int> length(A.size(), 1);
    for (int i = 1; i < A.size(); i++) {
      for (int j = 0; j < i; j++) {
        if (A[j] < A[i]) {
          length[i] = max(length[i], length[j]+1);
          res = max(length[i], res);
        }
      }
    }
    return res;
  }

  int main() {
    vector<int> A({2,0,1,3,5,2});
    cout << longestSubseq(A) << endl;
    return 0;
  }
#+END_SRC

#+RESULTS:
: 4

*** shortest paths in DAG
min(
#+BEGIN_SRC C++ :flags -std=c++11 :main no
  #include <iostream>
  #include <vector>
  #include <set>
  #include <deque>
  using namespace std;


  int ShortestPath(int testcase) {
      // construct graph
      vector<set<int>> edges(testcase+1);
      vector<int> incomes(testcase+1, 0);
      for (int i = 1; i <= testcase; i++) {
          for (int j = i+1; j <= testcase; j++) {
              if (j == i+1 || j == 3 * i) {
                  edges[i].insert(j);
                  incomes[j] ++;
              }
          }
      }

      // topological order traverse
      deque<int> tovisit({1});
      vector<int> dist(testcase+1, numeric_limits<int>::max());
      dist[1] = 0;
      while (!tovisit.empty()) {
          for (auto s : tovisit) {
              for (auto t : edges[s]) {
                  dist[t] = min(dist[t], dist[s]+1);
                  if (--incomes[t] == 0) {
                      tovisit.push_back(t);
                  }
              }
              tovisit.pop_front();
          }
      }
      return dist[testcase];
  }

  int main() {
    //code
    cout << ShortestPath(11) << endl;

    return 0;
  }
#+END_SRC

#+RESULTS:
: 4

